{"id":"d9a5fae0-ccd4-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.579Z","updated_by":"aakinshin","created_at":"2023-03-27T19:23:28.634Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Attempt to use mail server as relay","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Attempt to use mail server as relay (client host rejected)","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"2e4bd50a-dd21-432d-b9ff-f10c6dd2784e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and postfix.queueid: \"NOQUEUE\" and postfix.action: \"reject\" and postfix.smtp_stage: \"RCPT\" and postfix.status_code: 554\n\n\n\n\n","filters":[],"throttle":"no_actions","actions":[]}
{"id":"34d149c0-cced-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.577Z","updated_by":"aakinshin","created_at":"2023-03-27T22:17:49.421Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - started","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Postfix started","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"74061cac-6f3f-49bb-8951-61999d5cf5d3","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/master\" and  message : \"daemon started\"","filters":[],"throttle":"no_actions","actions":[]}
{"id":"cc5e88f0-cd62-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:35.545Z","updated_by":"aakinshin","created_at":"2023-03-28T12:19:34.779Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Illegal address from unknown sender","tags":["Postfix"],"interval":"5m","enabled":false,"description":"Postfix: Illegal address from unknown sender","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"133f32a4-f92c-4b19-961e-f0f8bd6352bf","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and log.level: \"warning\" and postfix.message : \"does not resolve to address\"","filters":[],"throttle":"no_actions","actions":[]}
{"id":"4bf22750-cd42-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.579Z","updated_by":"aakinshin","created_at":"2023-03-28T08:26:55.406Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - stopped","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Postfix stopped","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"49df1239-d216-4e1d-8a69-a6a010be52a5","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/master\" and postfix.termination_signal : *","filters":[],"throttle":"no_actions","actions":[]}
{"id":"d9e2b4c0-ccdf-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.573Z","updated_by":"aakinshin","created_at":"2023-03-27T20:42:13.401Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - IP Address black-listed by anti-spam","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Postfix: IP Address black-listed by anti-spam (blocked)","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"fb5870d3-61d7-47e4-855e-637b87b8a188","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and postfix.queueid: \"NOQUEUE\" and postfix.action: \"reject\" and postfix.status_code: (554 or 550) and postfix.status_message: \"blocked using\"","filters":[],"throttle":"no_actions","actions":[]}
{"id":"618f0590-ccea-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.574Z","updated_by":"aakinshin","created_at":"2023-03-27T21:57:36.066Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Process error","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Postfix process error","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"5536dd91-791c-46d3-acb3-74bbcc306ba7","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/postfix-script\" and log.level : \"fatal\" and postfix.message : (\"the Postfix mail system is not running\" or \"Resource temporarily unavailable\")","filters":[],"throttle":"no_actions","actions":[]}
{"id":"b7833a80-cd4d-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.574Z","updated_by":"aakinshin","created_at":"2023-03-28T09:48:40.458Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Multiple SASL authentication failures","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Postfix: Multiple SASL authentication failures","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"1f8a816c-b1bc-4a68-8fb0-3f9edc01e08c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and log.level: \"warning\" and postfix.message: \"SASL LOGIN authentication failed\"","filters":[],"threshold":{"field":["source.ip"],"value":5,"cardinality":[]},"throttle":"no_actions","actions":[]}
{"id":"31a2ebc0-cd72-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.580Z","updated_by":"aakinshin","created_at":"2023-03-28T14:09:47.182Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - RBL lookup error","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Postfix: RBL lookup error: Host or domain name not found","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"e93dc40f-0225-41f8-a0ca-201cd148ab17","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and log.level: \"warning\" and postfix.message : \"RBL lookup error\"","filters":[],"throttle":"no_actions","actions":[]}
{"id":"0a34d7f0-cd4b-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.577Z","updated_by":"aakinshin","created_at":"2023-03-28T09:29:30.649Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Multiple misuse of SMTP service","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Postfix: Multiple misuse of SMTP service (bad sequence of commands).","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"b524394f-93d0-4490-9569-c7adf34b9d20","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and postfix.queueid: \"NOQUEUE\" and postfix.action: \"reject\" and postfix.status_code: 503","filters":[],"threshold":{"field":["source.ip"],"value":5,"cardinality":[]},"throttle":"no_actions","actions":[]}
{"id":"199a3ae0-cd4c-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:39.144Z","updated_by":"aakinshin","created_at":"2023-03-28T09:37:05.972Z","created_by":"aakinshin","name":"[Log monitroing] Postfix - Multiple attempts to send e-mail from black-listed IP address","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Postfix: Multiple attempts to send e-mail from black-listed IP address (blocked).","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"e79b2edf-9ade-40e4-a6fb-b5e732379bcb","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and ((process.name: \"postfix/smtpd\" and postfix.status_code: 554) or (process.name: \"postfix/postscreen\" and postfix.status_code: 550)) and postfix.queueid: \"NOQUEUE\" and postfix.action: \"reject\" and postfix.status_message: \"blocked using\"","filters":[],"threshold":{"field":["source.ip"],"value":5,"cardinality":[]},"throttle":"no_actions","actions":[]}
{"id":"48b07ac0-cd4b-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.578Z","updated_by":"aakinshin","created_at":"2023-03-28T09:31:15.580Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Multiple attempts to send e-mail to invalid recipient or from unknown sender domain.","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Postfix: Multiple attempts to send e-mail to invalid recipient or from unknown sender domain.","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"dd758b50-e716-4cc8-8b6f-4cb77411611e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and postfix.queueid: \"NOQUEUE\" and postfix.action: \"reject\" and postfix.status_code: 504","filters":[],"threshold":{"field":["source.ip"],"value":5,"cardinality":[]},"throttle":"no_actions","actions":[]}
{"id":"3c2dfdd0-ccd9-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:35.545Z","updated_by":"aakinshin","created_at":"2023-03-27T19:54:51.901Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Sender domain is not found","tags":["Postfix"],"interval":"5m","enabled":false,"description":"450: Requested mail action not taken","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"f58d064e-71c5-4a25-80af-da43befc645d","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and postfix.queueid: \"NOQUEUE\" and postfix.action: \"reject\" and postfix.status_code: 450","filters":[],"throttle":"no_actions","actions":[]}
{"id":"c49ad5f0-ccd7-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.580Z","updated_by":"aakinshin","created_at":"2023-03-27T19:44:21.846Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Rejected by access list","tags":["Postfix"],"interval":"5m","enabled":true,"description":"- Postfix: Rejected by access list (Requested action not taken)","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"3bec8af6-bd94-4e43-ba42-67fd5d435f68","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/postscreen\" and postfix.queueid: \"NOQUEUE\" and postfix.action: \"reject\" and and postfix.status_code: 550","filters":[],"throttle":"no_actions","actions":[]}
{"id":"f4f75530-cd49-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:39.152Z","updated_by":"aakinshin","created_at":"2023-03-28T09:21:45.468Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Multiple relaying attempts of spam","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Postfix: Multiple relaying attempts of spam","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"0ce2655c-9527-43ca-ac18-ca77e8432d6b","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and postfix.queueid: \"NOQUEUE\" and postfix.action: \"reject\" and postfix.status_code: 554","filters":[],"threshold":{"field":["source.ip"],"value":5,"cardinality":[]},"throttle":"no_actions","actions":[]}
{"id":"02974bc0-ccda-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.575Z","updated_by":"aakinshin","created_at":"2023-03-27T20:00:24.864Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Recipient address must contain FQDN","tags":["Postfix"],"interval":"5m","enabled":true,"description":"504: Command parameter not implemented","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"ad010667-7989-4a74-8c6a-0f65c84301bf","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and postfix.queueid: \"NOQUEUE\" and postfix.action: \"reject\" and postfix.status_code: 504","filters":[],"throttle":"no_actions","actions":[]}
{"id":"9742ed40-cceb-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:35.545Z","updated_by":"aakinshin","created_at":"2023-03-27T22:06:15.578Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - SASL authentication failure","tags":["Postfix"],"interval":"5m","enabled":false,"description":"Postfix SASL authentication failure","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"da894b68-fa37-475f-9d66-0c08cad0c780","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and log.level: \"warning\" and postfix.message: \"SASL LOGIN authentication failed\"","filters":[],"throttle":"no_actions","actions":[]}
{"id":"a69c63f0-ccd9-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:39.144Z","updated_by":"aakinshin","created_at":"2023-03-27T19:57:50.346Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Improper use of SMTP command pipelining","tags":["Postfix"],"interval":"5m","enabled":true,"description":"503: Bad sequence of commands","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"f30870c4-d1b9-4020-974c-9b631b26fa40","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and postfix.queueid: \"NOQUEUE\" and postfix.action: \"reject\" and postfix.status_code: 503","filters":[],"throttle":"no_actions","actions":[]}
{"id":"3b65f840-ccec-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.574Z","updated_by":"aakinshin","created_at":"2023-03-27T22:10:51.625Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Insufficient disk space error","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Postfix insufficient disk space error","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"70a16a2b-bd3d-4360-b392-e748713802af","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and postfix.queueid: \"NOQUEUE\" and postfix.action: \"reject\" and postfix.status_code: 452","filters":[],"throttle":"no_actions","actions":[]}
{"id":"cd0d7a80-cd4a-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.576Z","updated_by":"aakinshin","created_at":"2023-03-28T09:27:48.027Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Multiple attempts to send e-mail from invalid/unknown sender domain","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Postfix: Multiple attempts to send e-mail from invalid/unknown sender domain","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"19052704-0cfc-4edc-acde-99e6670b1e70","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":5,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and postfix.queueid: \"NOQUEUE\" and postfix.action: \"reject\" and postfix.status_code: 450","filters":[],"threshold":{"field":["source.ip"],"value":5,"cardinality":[]},"throttle":"no_actions","actions":[]}
{"id":"32ccf200-cd60-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.580Z","updated_by":"aakinshin","created_at":"2023-03-28T12:00:58.363Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Not enough free space in mail queue","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Postfix - Not enough free space in mail queue","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"780f6158-2018-4fc0-a7d0-7bd4dadaed9a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and log.level: \"warning\" and postfix.message : \"not enough free space in mail queue\"","filters":[],"throttle":"no_actions","actions":[]}
{"id":"3dbd6610-cd4a-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.578Z","updated_by":"aakinshin","created_at":"2023-03-28T09:23:47.565Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Multiple attempts to send e-mail from a rejected sender","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Postfix: Multiple attempts to send e-mail from a rejected sender IP (access).","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"3a94e0f0-cbfa-4b15-8b4f-c6c66b227117","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and postfix.queueid: \"NOQUEUE\" and postfix.action: \"reject\" and postfix.status_code: 550","filters":[],"threshold":{"field":["source.ip"],"value":5,"cardinality":[]},"throttle":"no_actions","actions":[]}
{"id":"c4c04490-cd61-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.575Z","updated_by":"aakinshin","created_at":"2023-03-28T12:12:12.597Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Hostname verification failed","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Postfix: hostname verification failed","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"c6be38f8-17ff-4ce1-ae86-3a4490265b76","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and log.level: \"warning\" and postfix.message: \"verification failed: Name or service not known\"","filters":[],"throttle":"no_actions","actions":[]}
{"id":"e19eb8b0-cd40-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.578Z","updated_by":"aakinshin","created_at":"2023-03-28T08:16:48.712Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Too many errors after RCPT","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Postfix - Too many errors after RCPT","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"8a9f2129-d3a9-43a5-947f-e0774ef5ba32","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/smtpd\" and message: \"too many errors after RCPT\"","filters":[],"throttle":"no_actions","actions":[]}
{"id":"019b0140-cd65-11ed-b096-8b4a2a82a86b","updated_at":"2023-03-28T14:13:36.577Z","updated_by":"aakinshin","created_at":"2023-03-28T12:35:23.084Z","created_by":"aakinshin","name":"[Log monitoring] Postfix - Read-only file system","tags":["Postfix"],"interval":"5m","enabled":true,"description":"Postfix: Ignore permission warning","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://logs.mmtsvc.bz/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"559e8827-8966-4309-890f-1b080627c6d6","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-*"],"query":"event.module : \"postfix\" and process.name: \"postfix/postdrop\" and log.level : \"warning\" and postfix.message: \"Read-only file system\"","filters":[],"throttle":"no_actions","actions":[]}
{"exported_count":24,"exported_rules_count":24,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0}
